# learnPandas

In [145]:
%%javascript
// JAVASCRIPT CONETENTS
setTimeout(function(){
$(":header").each(function(i){ 
    var level = this.tagName[1]
    var buffer = ""
    for(var j = 0;j <= level; j++){

        buffer += "  "
    }
    buffer += "- "
    console.log(buffer)
    element.append("<code>"+ buffer + "</code>" + "<a href=#" + this.id + ">" + this.innerText + "</a><br>"); 
})
    },100);

## Resources 

https://pandas.pydata.org/pandas-docs/stable/10min.html

## Basic Data Structures

 - Series
 - DataFrames
 - Panels (collection of DataFrames)

## Imports

In [146]:
import pandas as pd
import numpy as np

## Example Series, Daterange index and Dataframe

In [147]:
s = pd.Series([1,3,5,np.nan,6,8])
dates = pd.date_range('01/01/2017', periods=8,freq='D')
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

### Create from Dictionary
df2 = pd.DataFrame({"A":1,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'
                   })

## Inspecting DataFrame

### head

In [148]:
df.head(n=2)

                   A         B         C         D
2017-01-01  0.249607 -0.014013  0.921569 -0.723285
2017-01-02  1.082288 -2.318332  0.195943 -0.143993

### tail

In [149]:
df.tail(n=1)

                   A         B         C         D
2017-01-08  0.767646  0.434356 -1.128176  0.651458

### describe

In [150]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean   0.353649  0.399676 -0.133185  0.158866
std    1.225742  1.235889  1.082810  1.092221
min   -2.340980 -2.318332 -1.128176 -1.355438
25%    0.175534  0.277987 -0.900149 -0.288816
50%    0.637119  0.518969 -0.577836 -0.004458
75%    0.846306  1.100759  0.377349  0.546440
max    1.843081  1.688032  1.949268  2.339670

### info

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 8 entries, 2017-01-01 to 2017-01-08
Freq: D
Data columns (total 4 columns):
A    8 non-null float64
B    8 non-null float64
C    8 non-null float64
D    8 non-null float64
dtypes: float64(4)
memory usage: 320.0 bytes

### columns

In [152]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### index

In [153]:
df.index

#print(xxxxx, end='\n\n',sep="\n")

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08'],
              dtype='datetime64[ns]', freq='D')

 <br>

## Selecting

### Select a Column (series type)

In [154]:
df['A']

2017-01-01    0.249607
2017-01-02    1.082288
2017-01-03   -0.046687
2017-01-04    0.594924
2017-01-05    1.843081
2017-01-06   -2.340980
2017-01-07    0.679314
2017-01-08    0.767646
Freq: D, Name: A, dtype: float64

### Select a Row slice

In [155]:
df[1:2]

                   A         B         C         D
2017-01-02  1.082288 -2.318332  0.195943 -0.143993

### Select by label - df.loc

In [156]:
# Selecting by multiaxis labels
df.loc[:dates[3],'B':'D']

                   B         C         D
2017-01-01 -0.014013  0.921569 -0.723285
2017-01-02 -2.318332  0.195943 -0.143993
2017-01-03  1.688032 -0.972317  0.070978
2017-01-04  0.603582 -0.642677 -0.079895

In [157]:
# Selecting a row (returns series)
df.loc[dates[3],:]

A    0.594924
B    0.603582
C   -0.642677
D   -0.079895
Name: 2017-01-04 00:00:00, dtype: float64

### Select by Position - df.iloc

In [158]:
# Select multiple axis position
df.iloc[3:5,2:]

                   C         D
2017-01-04 -0.642677 -0.079895
2017-01-05 -0.876094 -1.355438

### Boolean indexing

In [159]:
# Select by logical condition
df[df.A > 0]

                   A         B         C         D
2017-01-01  0.249607 -0.014013  0.921569 -0.723285
2017-01-02  1.082288 -2.318332  0.195943 -0.143993
2017-01-04  0.594924  0.603582 -0.642677 -0.079895
2017-01-05  1.843081  1.441178 -0.876094 -1.355438
2017-01-07  0.679314  0.375320 -0.512995  0.511434
2017-01-08  0.767646  0.434356 -1.128176  0.651458

In [160]:
df.iloc[3:5,2:]

                   C         D
2017-01-04 -0.642677 -0.079895
2017-01-05 -0.876094 -1.355438

### isin

In [161]:
# Adding a column
df['E'] = [1,2,3,4,5,6,7,8] 
df[df['E'].isin([3,4])]

                   A         B         C         D  E
2017-01-03 -0.046687  1.688032 -0.972317  0.070978  3
2017-01-04  0.594924  0.603582 -0.642677 -0.079895  4

<br>

## Missing Data

### dropna

In [162]:
df.loc[dates[0]:dates[3],'F'] = 20
df.dropna()

                   A         B         C         D  E     F
2017-01-01  0.249607 -0.014013  0.921569 -0.723285  1  20.0
2017-01-02  1.082288 -2.318332  0.195943 -0.143993  2  20.0
2017-01-03 -0.046687  1.688032 -0.972317  0.070978  3  20.0
2017-01-04  0.594924  0.603582 -0.642677 -0.079895  4  20.0

### fillna

In [163]:
df.fillna(value=30)
# note - these operations follow an immutable pattern

                   A         B         C         D  E     F
2017-01-01  0.249607 -0.014013  0.921569 -0.723285  1  20.0
2017-01-02  1.082288 -2.318332  0.195943 -0.143993  2  20.0
2017-01-03 -0.046687  1.688032 -0.972317  0.070978  3  20.0
2017-01-04  0.594924  0.603582 -0.642677 -0.079895  4  20.0
2017-01-05  1.843081  1.441178 -0.876094 -1.355438  5  30.0
2017-01-06 -2.340980  0.987285  1.949268  2.339670  6  30.0
2017-01-07  0.679314  0.375320 -0.512995  0.511434  7  30.0
2017-01-08  0.767646  0.434356 -1.128176  0.651458  8  30.0

### isnull

In [164]:
pd.isnull(df)

                A      B      C      D      E      F
2017-01-01  False  False  False  False  False  False
2017-01-02  False  False  False  False  False  False
2017-01-03  False  False  False  False  False  False
2017-01-04  False  False  False  False  False  False
2017-01-05  False  False  False  False  False   True
2017-01-06  False  False  False  False  False   True
2017-01-07  False  False  False  False  False   True
2017-01-08  False  False  False  False  False   True

## Reshaping

### Dropping column

In [165]:
# make a silly column
df[dates[0],'A']  = 4

In [166]:
df

,A,B,C,D,E,F,"(2017-01-01 00:00:00, A)"
2017-01-01,0.249607,-0.014013,0.921569,-0.723285,1,20.0,4
2017-01-02,1.082288,-2.318332,0.195943,-0.143993,2,20.0,4
2017-01-03,-0.046687,1.688032,-0.972317,0.070978,3,20.0,4
2017-01-04,0.594924,0.603582,-0.642677,-0.079895,4,20.0,4
2017-01-05,1.843081,1.441178,-0.876094,-1.355438,5,NaN,4
2017-01-06,-2.340980,0.987285,1.949268,2.339670,6,NaN,4
2017-01-07,0.679314,0.375320,-0.512995,0.511434,7,NaN,4
2017-01-08,0.767646,0.434356,-1.128176,0.651458,8,NaN,4

In [167]:
# remove the silly column
df.drop(labels=df.columns[5],axis=1,inplace=True)

<br>

## Sorting

### Sort Using sort_index note inplace default is false

In [168]:
df.T

,2017-01-01 00:00:00,2017-01-02 00:00:00,2017-01-03 00:00:00,2017-01-04 00:00:00,2017-01-05 00:00:00,2017-01-06 00:00:00,2017-01-07 00:00:00,2017-01-08 00:00:00
A,0.249607,1.082288,-0.046687,0.594924,1.843081,-2.340980,0.679314,0.767646
B,-0.014013,-2.318332,1.688032,0.603582,1.441178,0.987285,0.375320,0.434356
C,0.921569,0.195943,-0.972317,-0.642677,-0.876094,1.949268,-0.512995,-1.128176
D,-0.723285,-0.143993,0.070978,-0.079895,-1.355438,2.339670,0.511434,0.651458
E,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000
"(2017-01-01 00:00:00, A)",4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000

### Sort by Columns

In [169]:
df.sort_index(axis=0, ascending=False)

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-08,0.767646,0.434356,-1.128176,0.651458,8,4
2017-01-07,0.679314,0.375320,-0.512995,0.511434,7,4
2017-01-06,-2.340980,0.987285,1.949268,2.339670,6,4
2017-01-05,1.843081,1.441178,-0.876094,-1.355438,5,4
2017-01-04,0.594924,0.603582,-0.642677,-0.079895,4,4
2017-01-03,-0.046687,1.688032,-0.972317,0.070978,3,4
2017-01-02,1.082288,-2.318332,0.195943,-0.143993,2,4
2017-01-01,0.249607,-0.014013,0.921569,-0.723285,1,4

### Sort by index column

In [170]:
df.sort_index(axis=0, ascending=False)

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-08,0.767646,0.434356,-1.128176,0.651458,8,4
2017-01-07,0.679314,0.375320,-0.512995,0.511434,7,4
2017-01-06,-2.340980,0.987285,1.949268,2.339670,6,4
2017-01-05,1.843081,1.441178,-0.876094,-1.355438,5,4
2017-01-04,0.594924,0.603582,-0.642677,-0.079895,4,4
2017-01-03,-0.046687,1.688032,-0.972317,0.070978,3,4
2017-01-02,1.082288,-2.318332,0.195943,-0.143993,2,4
2017-01-01,0.249607,-0.014013,0.921569,-0.723285,1,4

### Sort by values

In [171]:
df.sort_values(by='B',ascending=False,axis=0)

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-03,-0.046687,1.688032,-0.972317,0.070978,3,4
2017-01-05,1.843081,1.441178,-0.876094,-1.355438,5,4
2017-01-06,-2.340980,0.987285,1.949268,2.339670,6,4
2017-01-04,0.594924,0.603582,-0.642677,-0.079895,4,4
2017-01-08,0.767646,0.434356,-1.128176,0.651458,8,4
2017-01-07,0.679314,0.375320,-0.512995,0.511434,7,4
2017-01-01,0.249607,-0.014013,0.921569,-0.723285,1,4
2017-01-02,1.082288,-2.318332,0.195943,-0.143993,2,4

## Edit column width for Long Strings

In [172]:
pd.set_option('display.max_colwidth', 200)

pd.DataFrame({"Long String":"""Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
Morbi sed tincidunt massa. Praesent iaculis molestie accumsan. 
Curabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna. 
Nulla velit ante, laoreet ut velit sit amet, faucibus congue mi."""},index=range(1))

                                                                                                                                                                                               Long String
0  Lorem ipsum dolor sit amet, consectetur adipiscing elit. \nMorbi sed tincidunt massa. Praesent iaculis molestie accumsan. \nCurabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna....

In [173]:
pd.set_option('display.max_colwidth', 50) # Default

pd.DataFrame({"Long String":"""Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
Morbi sed tincidunt massa. Praesent iaculis molestie accumsan. 
Curabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna. 
Nulla velit ante, laoreet ut velit sit amet, faucibus congue mi."""},index=range(1))

                                         Long String
0  Lorem ipsum dolor sit amet, consectetur adipis...

## Creating DataFrame from .csv

In [174]:
df3 = pd.read_csv('exampleCSV.csv')

In [175]:
%%bash
pip install progressbar2

Requirement already satisfied: progressbar2 in /Users/simon.ward-jones/anaconda/lib/python3.6/site-packages
Requirement already satisfied: python-utils>=2.1.0 in /Users/simon.ward-jones/anaconda/lib/python3.6/site-packages (from progressbar2)
Requirement already satisfied: six in /Users/simon.ward-jones/anaconda/lib/python3.6/site-packages (from python-utils>=2.1.0->progressbar2)

In [176]:
import progressbar
bar = progressbar.ProgressBar(widgets=[progressbar.Bar('=','{',"}"), progressbar.Percentage()])
for i in bar(range(800000)):
    bar.update(i+1)

{=========================================================================}100%